## Ecommerce Purchases (Solutions)

In [1]:
# import libraries
import numpy as np
import pandas as pd
import os

In [2]:
cwd = os.getcwd()
cwd

'C:\\Users\\Nazanin\\PycharmProjects\\KagglePractice'

In [3]:
# loop through the files in directory and display their name
files = [f for f in os.listdir('.') if os.path.isfile(f)]
for f in files:
    print(f)

main.py
Numpy.ipynb
Pandas for data analysis.ipynb
Pandas.ipynb
PythonExercise.ipynb
Untitled.ipynb

1. Please load the data in a variable “cust”, data file name is ‘Cust_Purch_FakeData.csv’.

In [4]:
# Read data from its URL
data_url = 'https://raw.githubusercontent.com/junaidqazi/DataSets_Practice_ScienceAcademy/master/Cust_Purch_FakeData.csv'
cust = pd.read_csv(data_url)

2. Its good idea to see how the data look like, display first 5 rows of your data-set.

In [5]:
cust.head()

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
0,Dr.,Ray,Morton,sebvajom@kol.km,Male,38,Medtronic Inc.,Health Therapist,(987) 619-2695,B6V 3W3,MB,5020000000000230,05/2018,Solo,8.36,Blue,126.23.139.2,Sunday,pm,04/05/1930
1,Miss,Claudia,Rodriquez,acu@jatsot.ug,Female,51,"Ames Department Stores, Inc.",Health Therapist,(356) 736-7352,G7M 5F3,SK,5020000000000230,07/2028,Visa,68.31,Black,106.198.76.211,Tuesday,am,12/20/1926
2,Miss,Harry,Meyer,zuz@lo.wf,Female,51,CSX Corp.,Political Scientist,(539) 246-1806,A0Z 6P9,NS,6300000000000000,02/2023,Switch,34.65,Black,186.150.187.29,Wednesday,pm,08/20/1931
3,Miss,Edith,Gilbert,hansohsi@jupec.md,Female,55,Murphy Oil Corporation,Transportation Manager,(984) 962-7494,P9I 9H3,YT,3530000000000000,02/2028,Maestro,64.59,White,80.140.57.161,Saturday,am,06/18/2001
4,Dr.,Lura,Murphy,webediti@je.st,Female,20,PETsMART Inc,Statistician,(902) 568-9748,S1A 6K0,ON,4030000000000000,10/2025,Diners Club International,20.83,Yellow,211.103.43.41,Friday,pm,06/14/2045

3. How many entries your data have? Can you tell the no. of columns in your data?

In [6]:
cust.info()
# 30000 entries, 0 to 29999
# total 20 columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 20 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   prefix      30000 non-null  object
 1   first       30000 non-null  object
 2   last        30000 non-null  object
 3   email       30000 non-null  object
 4   gender      30000 non-null  object
 5   age         30000 non-null  int64
 6   company     30000 non-null  object
 7   profession  30000 non-null  object
 8   phone       30000 non-null  object
 9   postal      30000 non-null  object
 10  province    30000 non-null  object
 11  cc_no       30000 non-null  int64
 12  cc_exp      30000 non-null  object
 13  cc_type     30000 non-null  object
 14  price(CAD)  30000 non-null  float64
 15  fav_color   30000 non-null  object
 16  ip          30000 non-null  object
 17  weekday     30000 non-null  object
 18  ampm        30000 non-null  object
 19  date        30000 non-null  object
dtypes: float64(1), int64(2), object(17)
memory usage: 4.6+ MB

4. What are the max and min ages of your customer? Can you find mean of your customer?

In [7]:
print('The minimum age of customers is: ',cust['age'].min())
print('The maximum age of customer is :',cust['age'].max())
print('The average age of customers is: ', cust['age'].mean())

The minimum age of customers is:  18
The maximum age of customer is : 65
The average age of customers is:  41.550066666666666

5. What are the three most common customer’s names?

Note:  value_counts() returns object containing counts of unique values. The resulting object will be in descending order so that the first element is the most frequently-occurring element. Excludes NA values by default.

In [8]:
cust['first'].value_counts().head(3)

Willie     130
Francis    124
Eula        86
Name: first, dtype: int64

6. Two customers have the same phone number, can you find those customers?

In [9]:
# lets find what phone number is twice!
cust['phone'].value_counts().head(2)

(263) 382-8004    2
(712) 247-7037    1
Name: phone, dtype: int64

In [10]:
# Now we know the phone number, let's find out the other stuff!
# cust['phone'] == '(263) 382-8004' --> returns True, false
cust[cust['phone'] == '(263) 382-8004'] # Returns values

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
15,Mrs.,Lilly,Tyler,kofadu@itohi.tf,Female,38,CSX Corp.,Structural Engineer,(263) 382-8004,V7K 1E3,ON,30000000000000,11/2022,Diners Club Carte Blanche,9.61,Yellow,74.124.37.227,Saturday,am,03/30/1985
16,Mrs.,Peter,Cain,megkosig@anazeor.gn,Male,27,Campbell Soup Co.,Insurance Adjuster,(263) 382-8004,E8T 2B4,YT,3530000000000000,03/2024,Solo,13.74,Black,25.207.141.135,Tuesday,am,08/05/1950

7. How many customers have profession “Structural Engineer”?

In [11]:
cust[cust['profession'] == 'Structural Engineer'].count()

# use any column such as ['last'] to get a number
cust[cust['profession'] == 'Structural Engineer'].count()['last']

87

8. How many male customers are ‘Structural Engineer’?

In [12]:
cust[(cust['gender'] == 'Male') & (cust['profession']== 'Structural Engineer')].count()

prefix        43
first         43
last          43
email         43
gender        43
age           43
company       43
profession    43
phone         43
postal        43
province      43
cc_no         43
cc_exp        43
cc_type       43
price(CAD)    43
fav_color     43
ip            43
weekday       43
ampm          43
date          43
dtype: int64

9. Find out the female Structural Engineers from province Alberta (AB)?

In [13]:
cust[(cust['gender'] == 'Female') & (cust['profession'] == 'Structural Engineer') & (cust['province'] == 'AB')]

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
8858,Dr.,Roy,Stanley,apiunvo@ehasom.ir,Female,39,Cincinnati Financial Corp.,Structural Engineer,(876) 758-2929,N5A 6L2,AB,6300000000000000,02/2022,InstaPayment,31.86,Red,165.249.159.57,Sunday,pm,12/25/1903
9058,Mr.,Lora,Kennedy,dennap@rabac.se,Female,51,BJ Services Company,Structural Engineer,(305) 786-6959,N3R 4B7,AB,201000000000000,06/2019,Diners Club United States & Canada,53.29,Black,42.216.243.206,Thursday,pm,06/06/2028
24736,Mrs.,Nell,Richards,dob@me.ki,Female,18,Telephone & Data Systems Inc,Structural Engineer,(262) 681-5018,N3Y 3G2,AB,347000000000000,07/2028,American Express,76.28,Blue,91.16.30.156,Wednesday,pm,07/14/1951
29865,Mrs.,Don,McDaniel,naf@zudu.bj,Female,37,Anadarko Petroleum Corporation,Structural Engineer,(238) 789-2825,B4A 8Q9,AB,5610000000000000,12/2022,Mastercard,62.71,Blue,162.233.117.142,Sunday,pm,11/03/1989

10. What is the max, min and average spending?

In [14]:
print('The max spending: ', cust['price(CAD)'].max())
print('The min spending: ', cust['price(CAD)'].min())
print('The average spending: ', cust['price(CAD)'].mean())

The max spending:  100.0
The min spending:  0.0
The average spending:  49.990775

11. Who did not spend anything? Company wants to send a deal to encourage the customer to buy

In [15]:
cust[cust['price(CAD)'] == 0.0]

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
5320,Dr.,Bruce,Bryan,ru@pubuspuh.cl,Male,59,Wal-Mart Stores Inc,Engineer Technician,(709) 446-8317,H6H 3Y0,NU,201000000000000,04/2024,Bankcard,0.0,White,82.70.62.64,Wednesday,am,12/11/1900
10597,Mrs.,Flora,Clark,wad@me.com,Female,27,MetLife Inc.,Cruise Director,(775) 373-6590,B2U 8K6,NB,30100000000000,05/2020,Diners Club Carte Blanche,0.0,Red,231.156.15.63,Thursday,pm,08/22/1904

12. As a loyalty reward, company wants to send thanks coupon to those who spent 100CAD or more, please find out the customers?

In [16]:
cust[cust['price(CAD)']>= 100.0]

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
76,Mrs.,Gregory,Brown,hav@jek.gs,Female,31,"E*Trade Group, Inc.",Novelist,(625) 537-8923,X3S 4Q2,PE,6010000000000000,04/2018,Visa,100.0,Green,212.100.18.95,Monday,am,10/23/2063
21093,Mrs.,Cody,Christensen,get@jovu.ag,Male,28,National City Corp.,Hospital Administrator,(261) 737-3292,X0S 1O5,PE,201000000000000,03/2024,JCB,100.0,Green,168.48.19.165,Wednesday,pm,03/28/1955
24385,Miss,Lizzie,Dixon,goh@tuwjaz.gd,Female,38,FleetBoston Financial Co.,Compensation Analyst,(989) 239-1752,V8X 9V6,NB,6300000000000000,07/2019,Bankcard,100.0,Blue,140.87.99.78,Saturday,pm,03/03/1983

13. How many emails are associated with this credit card number ‘5020000000000230’?

In [17]:
#cust[cust['cc_no'] == 5020000000000230].count()
cust[cust['cc_no'] == 5020000000000230]['email']

0    sebvajom@kol.km
1      acu@jatsot.ug
Name: email, dtype: object

14. We need to send new cards to the customers well before the expire, how many cards are expiring
in 2019? Use sum() and count() and see the difference in their use :)

In [18]:
#cust[cust['cc_exp'].apply(lambda x:x[5:] == '19')].count() # 2684
sum(cust['cc_exp'].apply(lambda x:x[5:] == '19')) # 2684

2684

15. How many people use Visa as their Credit Card Provider?

In [19]:
sum(cust['cc_type'] == 'Visa')

1721

16. Can you find the customer who spent 100 CAD using Visa?

In [20]:
cust[(cust['cc_type'] == 'Visa') & (cust['price(CAD)'] == 100.0)]

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
76,Mrs.,Gregory,Brown,hav@jek.gs,Female,31,"E*Trade Group, Inc.",Novelist,(625) 537-8923,X3S 4Q2,PE,6010000000000000,04/2018,Visa,100.0,Green,212.100.18.95,Monday,am,10/23/2063

17. What are two most common professions?

In [21]:
cust['profession'].value_counts().head(2)

Preschool Teacher       112
Distribution Manager    107
Name: profession, dtype: int64

18. Can you tell the top 5 most popular email providers? (e.g. gmail.com, yahoo.com, etc. . . )

In [22]:
cust['email'].apply(lambda x:x.split('@')[1]).value_counts().head()

gmail.com      1687
me.com         1676
outlook.com    1664
live.com       1660
hotmail.com    1659
Name: email, dtype: int64

19. Is there any customer who is using email with “am.edu”? Hint: Use lambda expression in apply().
split the email address at @

In [23]:
cust[cust['email'].apply(lambda x:x.split('@')[1]) == 'am.edu']

,prefix,first,last,email,gender,age,company,profession,phone,postal,province,cc_no,cc_exp,cc_type,price(CAD),fav_color,ip,weekday,ampm,date
150,Miss,Loretta,Fletcher,barit@am.edu,Female,48,York International Corp,Rehabilitation Counselor,(323) 279-8038,E5X 8L0,QC,6330000000000000,05/2021,Diners Club United States & Canada,97.26,White,147.57.240.225,Monday,am,11/07/2066

20. Which day of the week, the store gets more customers?

In [24]:
cust['weekday'].value_counts().head()

Saturday     4376
Wednesday    4365
Thursday     4327
Friday       4316
Monday       4216
Name: weekday, dtype: int64

## Chicago Payroll Data

In [25]:
# import pandas as pd
# import numpy as np

2. Read City_of_Chicago_Payroll_Data.csv as a dataframe in pay.

In [26]:
# read data from url
data_url_new = 'https://raw.githubusercontent.com/junaidqazi/DataSets_Practice_ScienceAcademy/master/City_of_Chicago_Payroll_Data.csv'

pay = pd.read_csv(data_url_new)
pay

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN
...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN

3. Show first five records in your data.

In [27]:
pay.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN

3. Get the overview of your data.

In [28]:
pay.info()
# 32658 entries, 0 to 32657
# total 8 columns
# Notice that: Typical Hours is the only float type. Typical Hours, Annual Salary and Hourly Rate have lots of NaN or null values.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

4. How many ‘NaN’ you have in each column in your data? Hint: use isnull()

In [29]:
pay.isnull().sum()

# If you want sorted values!
print(pay.isnull().sum().sort_values(ascending=False))

Typical Hours        24775
Hourly Rate          24775
Annual Salary         7883
Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
dtype: int64

5. Output the statistics for your dataset

In [30]:
pay.describe(include='all')
#include=None (default) : The result will include all numeric columns.

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775,7883
unique,32350,1095,36,2,2,NaN,1038,167
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,$35.60
freq,5,9393,12973,30676,24775,NaN,2368,1404
mean,NaN,NaN,NaN,NaN,NaN,34.698719,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,9.145553,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,20.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN

6. What are the maximum, minimum and average Typical Hours? (use ‘Typical Hours’ column)
Do you remember, pandas ignore NA/NaN/NULL values by default? pay[‘Typical Hours’].dropna().mean() should gives the same mean :) You may want to confirm!

In [31]:
print('The max value of Typical Hours: ', pay['Typical Hours'].max())
print('The min value of Typical Hours: ', pay['Typical Hours'].min())
#print('The average of Typical Hours: ', pay['Typical Hours'].dropna().mean())
print('The average of Typical Hours: ', pay['Typical Hours'].mean())

The max value of Typical Hours:  40.0
The min value of Typical Hours:  10.0
The average of Typical Hours:  34.69871876189268

7. How many employees are on salary and how many are working on hourly basis? Hint: Group the data on ‘Salary or Hourly’ column. Instead of whole dataset, you can take the single column as input as well

In [32]:
pay.groupby('Salary or Hourly').count()

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Annual Salary,Hourly Rate
Salary or Hourly,,,,,,,
Hourly,7883,7883,7883,7883,7883,0,7883
Salary,24775,24775,24775,24775,0,24775,0

8. Which department has maximum no of employees?

In [33]:
pay['Department'].value_counts().head(2)

POLICE    12973
FIRE       4800
Name: Department, dtype: int64

9. How many employees are on Salary and how many are on Hourly in the Police department?

In [34]:
pay[pay['Department'] == 'POLICE'].groupby('Salary or Hourly').count()['Department']

Salary or Hourly
Hourly       32
Salary    12941
Name: Department, dtype: int64

10. What are the mean, max and min salaries? 

use .str and replace() Create a new column name “Salaries” and separate the number from dollar sign as float . 
Hint: pandas.series.str and Stackoverflow link

In [35]:
pay['Salaries'] = pay['Annual Salary'].str.replace('$','').astype(float)
# df1['Avg_Annual'] = df1['Avg_Annual'].str.replace(',', '').str.replace('$', '').astype(int)
print('The max value of salaries: ', pay['Salaries'].max())
print('The min value of salaries: ', pay['Salaries'].min())
print('The average of salaries: ', pay['Salaries'].mean())

# Look at dataframe with new col
pay.head(2)

The max value of salaries:  300000.0
The min value of salaries:  0.96
The average of salaries:  87512.78024137235

C:\Users\Nazanin\AppData\Local\Temp\ipykernel_2088\1717616900.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  pay['Salaries'] = pay['Annual Salary'].str.replace('$','').astype(float)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0

11. Find an employee who has the maximum salary. Don’t use the max number you got above, write a code for general condition. Try with idxmax() as well!

In [36]:
#pay[pay['Salaries']==pay['Salaries'].max()]

pay.loc[pay['Salaries'].idxmax()]

Name                         EVANS,  GINGER S
Job Titles           COMMISSIONER OF AVIATION
Department                           AVIATION
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                      $300000.00
Hourly Rate                               NaN
Salaries                             300000.0
Name: 8310, dtype: object

12. Find an employee who has the minimum salary. Use idxmin() as well!

In [37]:
pay.loc[pay['Salaries'].idxmin()]
# pay[pay['Salaries'] == pay['Salaries'].min()]

Name                           KOCH,  STEVEN
Job Titles           ADMINISTRATIVE SECRETARY
Department                     MAYOR'S OFFICE
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                           $0.96
Hourly Rate                               NaN
Salaries                                 0.96
Name: 15387, dtype: object

13. What are the mean, max and min Hourly Rate? use .str and replace() Hint: Once again, create a new column name “H_Rate” and separate the number from dollar sign as float .

In [38]:
pay['H_Rate'] = pay['Hourly Rate'].str.replace('$','').astype(float)
pay.head()

print('The max value for Hourly Rate: ', pay['H_Rate'].max())
print('The min value for Hourly Rate: ', pay['H_Rate'].min())
print('The average value for Hourly Rate: ', pay['H_Rate'].mean())

The max value for Hourly Rate:  96.0
The min value for Hourly Rate:  2.65
The average value for Hourly Rate:  32.86819231257135

C:\Users\Nazanin\AppData\Local\Temp\ipykernel_2088\3992820059.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  pay['H_Rate'] = pay['Hourly Rate'].str.replace('$','').astype(float)

14. How many employees are getting max Hourly Rate?

In [39]:
pay[pay['H_Rate'] == pay['H_Rate'].max()].count()

Name                 1
Job Titles           1
Department           1
Full or Part-Time    1
Salary or Hourly     1
Typical Hours        1
Annual Salary        0
Hourly Rate          1
Salaries             0
H_Rate               1
dtype: int64

15. Who is getting max Hourly Rate?

In [40]:
pay[pay['H_Rate'] == pay['H_Rate'].max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

16. How many employees are earning less than the average Hourly Rate?

In [41]:
pay[pay['H_Rate'] < pay['H_Rate'].mean()].count()['H_Rate']

2791

17. How many employees are paid hourly and they have full-time job?

In [42]:
pay[(pay['Salary or Hourly'] == 'Hourly') & (pay['Full or Part-Time'] == 'F')].count()

# another way
pay[(pay['Hourly Rate'].notnull()) # or we use H_Rate
   & (pay['Full or Part-Time'] == 'F')].count()['Full or Part-Time']

5906

18. Find the full-time employees who are working at hourly rate of $10.00?

In [43]:
pay[(pay['Full or Part-Time'] == 'F') & (pay['H_Rate'] == 10.00)] #or (pay['Hourly Rate']=='$10.00')

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salaries,H_Rate
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

19. How many unique Job Titles are there in the data?

In [44]:
pay['Job Titles'].nunique()

1095

20. What was the average Salary of the employees in each department?

In [45]:
pay.groupby('Department').mean()['Salaries']

C:\Users\Nazanin\AppData\Local\Temp\ipykernel_2088\3153909858.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  pay.groupby('Department').mean()['Salaries']

Department
ADMIN HEARNG             78912.947368
ANIMAL CONTRL            66089.684211
AVIATION                 76140.018777
BOARD OF ELECTION        56051.142857
BOARD OF ETHICS          94552.500000
BUDGET & MGMT            93925.395349
BUILDINGS                98864.833534
BUSINESS AFFAIRS         80446.425000
CITY CLERK               69762.439024
CITY COUNCIL             63577.172069
COMMUNITY DEVELOPMENT    88363.257143
COPA                     98784.705882
CULTURAL AFFAIRS         87048.909091
DISABILITIES             82431.724138
DoIT                     99681.029703
FAMILY & SUPPORT         79013.588785
FINANCE                  73276.364662
FIRE                     97762.348662
GENERAL SERVICES         83095.528390
HEALTH                   85488.210938
HUMAN RELATIONS          93778.588235
HUMAN RESOURCES          79851.761194
INSPECTOR GEN            84030.666667
IPRA                     94429.285714
LAW                      84582.814404
LICENSE APPL COMM        80568.000000
MAYOR'S OFFICE           96165.512308
OEMC                     73153.778221
POLICE                   87836.025349
POLICE BOARD             86136.000000
PROCUREMENT              83278.243902
PUBLIC LIBRARY           71273.288136
STREETS & SAN            84347.775701
TRANSPORTN               89976.896061
TREASURER                88062.652174
WATER MGMNT              89894.111803
Name: Salaries, dtype: float64

21. What is the job title of ‘AGAR, BULENT B’? please note, there are two spaces between AGAR, and
BULENT.

In [46]:
pay[pay['Name'] == 'AGAR,  BULENT B']['Job Titles']

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

22. What are the top most common job titles?

In [47]:
pay['Job Titles'].value_counts().head()

POLICE OFFICER                            9393
FIREFIGHTER-EMT                           1424
SERGEANT                                  1118
POOL MOTOR TRUCK DRIVER                    996
POLICE OFFICER (ASSIGNED AS DETECTIVE)     845
Name: Job Titles, dtype: int64

23. How many people have the word ‘officer’ in their job title? (This is pretty tricky)

In [48]:
# build a function
def find_title(title):
    if 'officer' in title.lower():
        return True
    else:
        return False
    
sum(pay['Job Titles'].apply(lambda x:find_title(x)))

11101